{
    "Constructors and Destructors": "Constructors and Destructors\n\n",
    "Constructor": "Constructor\n\nvoid __construct ([ mixed $args = \"\" [,  $... ]] )\nPHP 5 allows developers to declare constructor methods for classes. Classes\nwhich have a constructor method call this method on each newly-created object,\nso it is suitable for any initialization that the object may need before it is\nused.\n     Note:  Parent constructors are not called implicitly if the child\n     class defines a constructor. In order to run a parent constructor, a\n     call to parent::__construct() within the child constructor is\n     required. If the child does not define a constructor then it may be\n     inherited from the parent class just like a normal class method (if\n     it was not declared as private).\nExample #1 using new unified constructors\n<?php\nclass BaseClass {\n   function __construct() {\n       print \"In BaseClass constructor\\n\";\n   }\n}\n\nclass SubClass extends BaseClass {\n   function __construct() {\n       parent::__construct();\n       print \"In SubClass constructor\\n\";\n   }\n}\n\nclass OtherSubClass extends BaseClass {\n    \/\/ inherits BaseClass's constructor\n}\n\n\/\/ In BaseClass constructor\n$obj = new BaseClass();\n\n\/\/ In BaseClass constructor\n\/\/ In SubClass constructor\n$obj = new SubClass();\n\n\/\/ In BaseClass constructor\n$obj = new OtherSubClass();\n?>\nFor backwards compatibility, if PHP 5 cannot find a __construct() function for\na given class, and the class did not inherit one from a parent class, it will\nsearch for the old-style constructor function, by the name of the class.\nEffectively, it means that the only case that would have compatibility issues\nis if the class had a method named __construct() which was used for different\nsemantics.\nUnlike with other methods, PHP will not generate an E_STRICT level error\nmessage when __construct() is overridden with different parameters than the\nparent __construct() method has.\nAs of PHP 5.3.3, methods with the same name as the last element of a namespaced\nclass name will no longer be treated as constructor. This change doesn't affect\nnon-namespaced classes.\nExample #2 Constructors in namespaced classes\n<?php\nnamespace Foo;\nclass Bar {\n    public function Bar() {\n        \/\/ treated as constructor in PHP 5.3.0-5.3.2\n        \/\/ treated as regular method as of PHP 5.3.3\n    }\n}\n?>\n",
    "Destructor": "Destructor\n\nvoid __destruct ( void )\nPHP 5 introduces a destructor concept similar to that of other object-oriented\nlanguages, such as C++. The destructor method will be called as soon as there\nare no other references to a particular object, or in any order during the\nshutdown sequence.\nExample #3 Destructor Example\n<?php\nclass MyDestructableClass {\n   function __construct() {\n       print \"In constructor\\n\";\n       $this->name = \"MyDestructableClass\";\n   }\n\n   function __destruct() {\n       print \"Destroying \" . $this->name . \"\\n\";\n   }\n}\n\n$obj = new MyDestructableClass();\n?>\nLike constructors, parent destructors will not be called implicitly by the\nengine. In order to run a parent destructor, one would have to explicitly call\nparent::__destruct() in the destructor body. Also like constructors, a child\nclass may inherit the parent's destructor if it does not implement one itself.\nThe destructor will be called even if script execution is stopped using exit().\nCalling exit() in a destructor will prevent the remaining shutdown routines\nfrom executing.\n     Note:\n     Destructors called during the script shutdown have HTTP headers\n     already sent. The working directory in the script shutdown phase can\n     be different with some SAPIs (e.g. Apache).\n     Note:\n     Attempting to throw an exception from a destructor (called in the\n     time of script termination) causes a fatal error.\n[add_a_note]_add_a_note\n"
}